# Local database file

In [ ]:
import sqlite3
connection = sqlite3.connect("company.db")

cursor = connection.cursor()

sql_command = """
CREATE TABLE employee ( 
staff_number INTEGER PRIMARY KEY, 
fname VARCHAR(20), 
lname VARCHAR(30), 
gender CHAR(1), 
joining DATE,
birth_date DATE);"""

cursor.execute(sql_command)

In [11]:
sql_command = """INSERT INTO employee (staff_number, fname, lname, gender, birth_date)
    VALUES (NULL, "William", "Shakespeare", "m", "1961-10-25");"""
cursor.execute(sql_command)


sql_command = """INSERT INTO employee (staff_number, fname, lname, gender, birth_date)
    VALUES (NULL, "Frank", "Schiller", "m", "1955-08-17");"""
cursor.execute(sql_command)

# never forget this, if you want the changes to be saved:
connection.commit()

connection.close()

In [12]:
import sqlite3
connection = sqlite3.connect("company.db")

cursor = connection.cursor()

staff_data = [ ("William", "Shakespeare", "m", "1961-10-25"),
               ("Frank", "Schiller", "m", "1955-08-17"),
               ("Jane", "Wall", "f", "1989-03-14") ]
               
for p in staff_data:
    format_str = """INSERT INTO employee (staff_number, fname, lname, gender, birth_date)
    VALUES (NULL, "{first}", "{last}", "{gender}", "{birthdate}");"""

    sql_command = format_str.format(first=p[0], last=p[1], gender=p[2], birthdate = p[3])
    cursor.execute(sql_command)

In [13]:
import sqlite3
connection = sqlite3.connect("company.db")

cursor = connection.cursor()

cursor.execute("SELECT * FROM employee") 
print("fetchall:")
result = cursor.fetchall() 
for r in result:
    print(r)
cursor.execute("SELECT * FROM employee") 
print("\nfetch one:")
res = cursor.fetchone() 
print(res)

fetchall:
(1, 'William', 'Shakespeare', 'm', None, '1961-10-25')
(2, 'Frank', 'Schiller', 'm', None, '1955-08-17')

fetch one:
(1, 'William', 'Shakespeare', 'm', None, '1961-10-25')

# MySQL Connector
https://www.w3schools.com/python/python_mysql_getstarted.asp

In [24]:
import mysql.connector

In [25]:
host = 'host'
user = 'user'
password = 'pass'
port = 3306
db = 'db'

In [37]:
mydb = mysql.connector.connect(
  host=host,
  user=user,
  passwd=password
)

In [27]:
print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x115261cf8>

In [44]:
mycursor = mydb.cursor(buffered=True,dictionary=True)

In [46]:
mycursor.execute("SHOW DATABASES")
for x in mycursor:
    print(x)

{'Database': 'information_schema'}
{'Database': 'sql7307745'}

In [49]:
mycursor.execute('USE sql7307745;')

In [50]:
mycursor.execute("CREATE TABLE customers (name VARCHAR(255), address VARCHAR(255))")

In [51]:
mycursor.execute("SHOW TABLES")

for x in mycursor:
    print(x)

{'Tables_in_sql7307745': 'customers'}
{'Tables_in_sql7307745': 'mydatabase'}

In [56]:
sql = "INSERT INTO customers (name, address) VALUES (%s, %s)"
val = ("John", "Highway 21")

mycursor.execute(sql, val)

mydb.commit()

In [57]:
print(mycursor.rowcount, "record inserted.")

1 record inserted.

In [58]:
sql = "INSERT INTO customers (name, address) VALUES (%s, %s)"
val = [
  ('Peter', 'Lowstreet 4'),
  ('Amy', 'Apple st 652'),
  ('Hannah', 'Mountain 21'),
  ('Michael', 'Valley 345'),
  ('Sandy', 'Ocean blvd 2'),
  ('Betty', 'Green Grass 1'),
  ('Richard', 'Sky st 331'),
  ('Susan', 'One way 98'),
  ('Vicky', 'Yellow Garden 2'),
  ('Ben', 'Park Lane 38'),
  ('William', 'Central st 954'),
  ('Chuck', 'Main Road 989'),
  ('Viola', 'Sideway 1633')
]

mycursor.executemany(sql, val)

mydb.commit()

print(mycursor.rowcount, "was inserted.")

13 was inserted.

In [59]:
mycursor.execute("Select * From customers")

for x in mycursor:
    print(x)

{'name': 'John', 'address': 'Highway 21'}
{'name': 'John', 'address': 'Highway 21'}
{'name': 'Peter', 'address': 'Lowstreet 4'}
{'name': 'Amy', 'address': 'Apple st 652'}
{'name': 'Hannah', 'address': 'Mountain 21'}
{'name': 'Michael', 'address': 'Valley 345'}
{'name': 'Sandy', 'address': 'Ocean blvd 2'}
{'name': 'Betty', 'address': 'Green Grass 1'}
{'name': 'Richard', 'address': 'Sky st 331'}
{'name': 'Susan', 'address': 'One way 98'}
{'name': 'Vicky', 'address': 'Yellow Garden 2'}
{'name': 'Ben', 'address': 'Park Lane 38'}
{'name': 'William', 'address': 'Central st 954'}
{'name': 'Chuck', 'address': 'Main Road 989'}
{'name': 'Viola', 'address': 'Sideway 1633'}

In [62]:
mycursor.execute("SELECT name, address FROM customers")

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

{'name': 'John', 'address': 'Highway 21'}
{'name': 'John', 'address': 'Highway 21'}
{'name': 'Peter', 'address': 'Lowstreet 4'}
{'name': 'Amy', 'address': 'Apple st 652'}
{'name': 'Hannah', 'address': 'Mountain 21'}
{'name': 'Michael', 'address': 'Valley 345'}
{'name': 'Sandy', 'address': 'Ocean blvd 2'}
{'name': 'Betty', 'address': 'Green Grass 1'}
{'name': 'Richard', 'address': 'Sky st 331'}
{'name': 'Susan', 'address': 'One way 98'}
{'name': 'Vicky', 'address': 'Yellow Garden 2'}
{'name': 'Ben', 'address': 'Park Lane 38'}
{'name': 'William', 'address': 'Central st 954'}
{'name': 'Chuck', 'address': 'Main Road 989'}
{'name': 'Viola', 'address': 'Sideway 1633'}

# SQL Alchemy engine
https://docs.sqlalchemy.org/en/13/dialects/mysql.html

In [76]:
import pandas as pd
from sqlalchemy import create_engine

%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [75]:
#mysql+mysqlconnector://<user>:<password>@<host>[:<port>]/<dbname>

engine = create_engine('mysql+mysqlconnector://<user>:<password>@<host>[:<port>]/<dbname>')

In [80]:
sql = """Select * From customers"""

In [82]:
pd.read_sql_query(sql, engine).head()

     name       address
0    John    Highway 21
1    John    Highway 21
2   Peter   Lowstreet 4
3     Amy  Apple st 652
4  Hannah   Mountain 21

# %SQL Magic Jupyter Notebook
https://www.mssqltips.com/sqlservertip/6120/data-exploration-with-python-and-sql-server-using-jupyter-notebooks/

In [84]:
%sql mysql+mysqlconnector://<user>:<password>@<host>[:<port>]/<dbname>

'Connected: sql7307745@sql7307745'

In [85]:
%sql Show tables

 * mysql+mysqlconnector://sql7307745:***@sql7.freesqldatabase.com:3306/sql7307745
2 rows affected.

[('customers',), ('mydatabase',)]

In [102]:
db_query = '''select address from customers limit 5'''

In [101]:
result = %sql $db_query

result

 * mysql+mysqlconnector://sql7307745:***@sql7.freesqldatabase.com:3306/sql7307745
10 rows affected.

[('Highway 21',),
 ('Highway 21',),
 ('Lowstreet 4',),
 ('Apple st 652',),
 ('Mountain 21',),
 ('Valley 345',),
 ('Ocean blvd 2',),
 ('Green Grass 1',),
 ('Sky st 331',),
 ('One way 98',)]